{"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "bmm_input"}, "name": "bmm_input", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [-1, 1, 1]}, "name": "reshape_4", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_14", "inbound_nodes": [[["reshape_4", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_53", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_53", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_15", "inbound_nodes": [[["p_re_lu_53", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_54", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_54", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_16", "inbound_nodes": [[["p_re_lu_54", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_55", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_55", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_17", "inbound_nodes": [[["p_re_lu_55", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_56", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_56", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_18", "inbound_nodes": [[["p_re_lu_56", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_57", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_57", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_19", "inbound_nodes": [[["p_re_lu_57", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_58", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_58", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_20", "inbound_nodes": [[["p_re_lu_58", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_59", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_59", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_21", "inbound_nodes": [[["p_re_lu_59", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_60", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_60", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_22", "inbound_nodes": [[["p_re_lu_60", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_61", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_61", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_23", "inbound_nodes": [[["p_re_lu_61", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_62", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_62", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_24", "inbound_nodes": [[["p_re_lu_62", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_63", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_63", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_25", "inbound_nodes": [[["p_re_lu_63", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_64", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_64", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_26", "inbound_nodes": [[["p_re_lu_64", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_65", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_65", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_27", "inbound_nodes": [[["p_re_lu_65", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_66", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_66", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_42", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_42", "inbound_nodes": [[["p_re_lu_66", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_56", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_56", "inbound_nodes": [[["p_re_lu_66", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_70", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_70", "inbound_nodes": [[["p_re_lu_66", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_67", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_67", "inbound_nodes": [[["conv2d_transpose_42", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_80", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_80", "inbound_nodes": [[["conv2d_transpose_56", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_93", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_93", "inbound_nodes": [[["conv2d_transpose_70", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_39", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_39", "inbound_nodes": [[["p_re_lu_67", 0, 0, {}], ["conv2d_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_52", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_52", "inbound_nodes": [[["p_re_lu_80", 0, 0, {}], ["conv2d_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_65", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_65", "inbound_nodes": [[["p_re_lu_93", 0, 0, {}], ["conv2d_26", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_43", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_43", "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_57", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_57", "inbound_nodes": [[["concatenate_52", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_71", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_71", "inbound_nodes": [[["concatenate_65", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_68", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_68", "inbound_nodes": [[["conv2d_transpose_43", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_81", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_81", "inbound_nodes": [[["conv2d_transpose_57", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_94", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_94", "inbound_nodes": [[["conv2d_transpose_71", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_40", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_40", "inbound_nodes": [[["p_re_lu_68", 0, 0, {}], ["conv2d_25", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_53", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_53", "inbound_nodes": [[["p_re_lu_81", 0, 0, {}], ["conv2d_25", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_66", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_66", "inbound_nodes": [[["p_re_lu_94", 0, 0, {}], ["conv2d_25", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_44", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_44", "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_58", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_58", "inbound_nodes": [[["concatenate_53", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_72", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_72", "inbound_nodes": [[["concatenate_66", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_69", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_69", "inbound_nodes": [[["conv2d_transpose_44", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_82", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_82", "inbound_nodes": [[["conv2d_transpose_58", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_95", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_95", "inbound_nodes": [[["conv2d_transpose_72", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_41", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_41", "inbound_nodes": [[["p_re_lu_69", 0, 0, {}], ["conv2d_24", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_54", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_54", "inbound_nodes": [[["p_re_lu_82", 0, 0, {}], ["conv2d_24", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_67", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_67", "inbound_nodes": [[["p_re_lu_95", 0, 0, {}], ["conv2d_24", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_45", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_45", "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_59", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_59", "inbound_nodes": [[["concatenate_54", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_73", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_73", "inbound_nodes": [[["concatenate_67", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_70", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_70", "inbound_nodes": [[["conv2d_transpose_45", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_83", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_83", "inbound_nodes": [[["conv2d_transpose_59", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_96", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_96", "inbound_nodes": [[["conv2d_transpose_73", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_42", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_42", "inbound_nodes": [[["p_re_lu_70", 0, 0, {}], ["conv2d_23", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_55", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_55", "inbound_nodes": [[["p_re_lu_83", 0, 0, {}], ["conv2d_23", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_68", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_68", "inbound_nodes": [[["p_re_lu_96", 0, 0, {}], ["conv2d_23", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_46", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_46", "inbound_nodes": [[["concatenate_42", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_60", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_60", "inbound_nodes": [[["concatenate_55", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_74", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_74", "inbound_nodes": [[["concatenate_68", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_71", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_71", "inbound_nodes": [[["conv2d_transpose_46", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_84", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_84", "inbound_nodes": [[["conv2d_transpose_60", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_97", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_97", "inbound_nodes": [[["conv2d_transpose_74", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_43", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_43", "inbound_nodes": [[["p_re_lu_71", 0, 0, {}], ["conv2d_22", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_56", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_56", "inbound_nodes": [[["p_re_lu_84", 0, 0, {}], ["conv2d_22", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_69", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_69", "inbound_nodes": [[["p_re_lu_97", 0, 0, {}], ["conv2d_22", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_47", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_47", "inbound_nodes": [[["concatenate_43", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_61", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_61", "inbound_nodes": [[["concatenate_56", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_75", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_75", "inbound_nodes": [[["concatenate_69", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_72", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_72", "inbound_nodes": [[["conv2d_transpose_47", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_85", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_85", "inbound_nodes": [[["conv2d_transpose_61", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_98", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_98", "inbound_nodes": [[["conv2d_transpose_75", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_44", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_44", "inbound_nodes": [[["p_re_lu_72", 0, 0, {}], ["conv2d_21", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_57", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_57", "inbound_nodes": [[["p_re_lu_85", 0, 0, {}], ["conv2d_21", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_70", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_70", "inbound_nodes": [[["p_re_lu_98", 0, 0, {}], ["conv2d_21", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_48", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_48", "inbound_nodes": [[["concatenate_44", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_62", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_62", "inbound_nodes": [[["concatenate_57", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_76", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_76", "inbound_nodes": [[["concatenate_70", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_73", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_73", "inbound_nodes": [[["conv2d_transpose_48", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_86", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_86", "inbound_nodes": [[["conv2d_transpose_62", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_99", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_99", "inbound_nodes": [[["conv2d_transpose_76", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_45", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_45", "inbound_nodes": [[["p_re_lu_73", 0, 0, {}], ["conv2d_20", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_58", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_58", "inbound_nodes": [[["p_re_lu_86", 0, 0, {}], ["conv2d_20", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_71", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_71", "inbound_nodes": [[["p_re_lu_99", 0, 0, {}], ["conv2d_20", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_49", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_49", "inbound_nodes": [[["concatenate_45", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_63", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_63", "inbound_nodes": [[["concatenate_58", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_77", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_77", "inbound_nodes": [[["concatenate_71", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_74", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_74", "inbound_nodes": [[["conv2d_transpose_49", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_87", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_87", "inbound_nodes": [[["conv2d_transpose_63", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_100", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_100", "inbound_nodes": [[["conv2d_transpose_77", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_46", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_46", "inbound_nodes": [[["p_re_lu_74", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_59", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_59", "inbound_nodes": [[["p_re_lu_87", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_72", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_72", "inbound_nodes": [[["p_re_lu_100", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_50", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_50", "inbound_nodes": [[["concatenate_46", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_64", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_64", "inbound_nodes": [[["concatenate_59", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_78", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_78", "inbound_nodes": [[["concatenate_72", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_75", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_75", "inbound_nodes": [[["conv2d_transpose_50", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_88", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_88", "inbound_nodes": [[["conv2d_transpose_64", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_101", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_101", "inbound_nodes": [[["conv2d_transpose_78", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_47", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_47", "inbound_nodes": [[["p_re_lu_75", 0, 0, {}], ["conv2d_18", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_60", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_60", "inbound_nodes": [[["p_re_lu_88", 0, 0, {}], ["conv2d_18", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_73", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_73", "inbound_nodes": [[["p_re_lu_101", 0, 0, {}], ["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_51", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_51", "inbound_nodes": [[["concatenate_47", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_65", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_65", "inbound_nodes": [[["concatenate_60", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_79", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 1], "strides": [2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_79", "inbound_nodes": [[["concatenate_73", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_76", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_76", "inbound_nodes": [[["conv2d_transpose_51", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_89", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_89", "inbound_nodes": [[["conv2d_transpose_65", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "p_re_lu_102", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "p_re_lu_102", "inbound_nodes": [[["conv2d_transpose_79", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_48", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_48", "inbound_nodes": [[["p_re_lu_76", 0, 0, {}], ["conv2d_17", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_61", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_61", 